// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

function checkNumber(params) {
  let number = Number(prompt('Введіть число'));

  if (number === 10) {
    alert('Вірно');
  } else {
    alert('Не вірно');
  }
  console.log(number)
}

checkNumber();